[
  {
    "title": "Webhook Router & Edge Ingress Service",
    "description": "Lightweight webhook ingress and routing service with token-based authentication, file-backed secret management, rate limiting, and containerized deployment. Designed for reliability, easy key rotation, and internal service isolation.",
    "highlights": [
      "Edge ingress service authenticates requests via per-client tokens",
      "Secrets loaded from a file-backed key store (bind-mounted into container)",
      "Key ownership mapping enables fast revoke/rotate without code changes",
      "Strict request size limits and per-IP rate limiting",
      "Clear separation between edge ingress and internal router service",
      "Dockerized services with profile-based startup for local vs production use"
    ],
    "tech": [
      "Python",
      "FastAPI",
      "Webhooks",
      "Authentication",
      "Docker",
      "Homelab",
      "Infrastructure"
    ],
    "impact": "Enabled secure, centralized ingestion of internal webhooks across multiple self-hosted services, with fast key rotation and zero-downtime config changes.",
    "links": {
      "repo": "https://github.com/tcdrozd/webhook-router",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Shared Photo Frame Platform",
    "description": "A self-hosted, end-to-end photo frame ecosystem designed for non-technical users to safely upload photos while maintaining a resilient, offline-first display client. Built to run unattended on low-power hardware, with cloud-backed manifests, strict access control, and automated synchronization.",
    "highlights": [
      "Offline-first frame client (Raspberry Pi & Android tablet support) that continues operating without network access",
      "Cloud-backed manifest-driven architecture decoupling content selection from display logic",
      "Automated publisher pipeline generating deterministic manifests from S3 object state",
      "Secure, minimal-permission upload workflows using presigned URLs and scoped IAM policies",
      "Multiple ingestion paths: web upload UI, HTTP drop endpoints, Samba/photo-drop workflows",
      "Systemd-managed services for frame runtime, sync jobs, and watchdog reliability",
      "Clear separation of concerns: publisher, viewer, sync tooling, and client UI",
      "Designed explicitly for long-term unattended operation in real-world home deployments"
    ],
    "tech": [
      "Python",
      "Flask",
      "AWS S3",
      "Raspberry Pi",
      "Systemd",
      "Linux",
      "JavaScript (static client)",
      "Nginx",
      "IAM / Presigned URLs"
    ],
    "impact": "Deployed in a real family environment with non-technical users; operates unattended for weeks at a time without intervention.",
    "links": {
      "repo": "https://github.com/tcdrozd/shared-photo-frame",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Wiki-Manager API for Wiki.js",
    "description": "FastAPI service that creates/updates Wiki.js pages via API with robust path handling and markdown sanitation.",
    "highlights": [
      "Tested edge cases: special chars, deep paths, empty fields",
      "Token-based auth; retries + idempotent upsert by path",
      "JSON schemas for inputs; markdown normalization",
      "TODO add example payload / screenshot"
    ],
    "tech": [
      "FastAPI",
      "Wiki.js",
      "API Integration",
      "Auth",
      "Validation",
      "CI"
    ],
    "impact": "Cut documentation time ~70%; consistent pages with automatic sectioning and breadcrumbs.",
    "links": {
      "repo": "https://github.com/tcdrozd/wiki-manager",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Frigate NVR on GPU VM + Coral TPU",
    "description": "Dockerized Frigate on GPU VM with Coral USB TPU, 8 RTSP streams, object zones, and HA integration.",
    "highlights": [
      "Detector tuning (TPU) + zones per camera",
      "Bind-mount storage; retention/cleanup policies",
      "Health checks and alerts wired to ntfy",
      "Docs: setup, troubleshooting, TPU/kernel highlights",
      "TODO add diagram cameras >> Nightowl >> rtsp >> Frigate >> Storage >> HA Integration >> Alert"
    ],
    "tech": ["Docker", "Frigate", "TPU", "Home Assistant", "NVR", "DevOps"],
    "impact": "Stable 8-camera ingestion; recordings offloaded to HDD; Low-latency detections suitable for live automations (measured informally in HA events).",
    "links": {
      "repo": "",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Proxmox System Dashboard API",
    "description": "Flask service that pulls Proxmox metrics (nodes/VMs/LXCs) and exposes an API for a custom dark UI with an ntfy heartbeat footer.",
    "highlights": [
      "Token auth to Proxmox; robust error handling",
      "Heartbeat feed renders last 7 events (ntfy)",
      "Git-based deploy to home server",
      "TODO screenshot | add endpoints"
    ],
    "tech": ["Flask", "Proxmox API", "Observability", "ntfy", "GitOps"],
    "impact": "Replaced per-host polling with unified API; faster incident triage and fewer blind spots.",
    "links": {
      "repo": "https://github.com/tcdrozd/proxmox-dashboard",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Heartbeat Checks via NTFY (cron + shell)",
    "description": "Tiny healthcheck/heartbeat mesh: cron + shell client posts uptime and service status to ntfy; optional FastAPI relay.",
    "highlights": [
      "/usr/local/bin/heartbeat.sh with host tech",
      "Topic naming convention + retention docs",
      "Container-safe: curl-only option; no agents"
    ],
    "tech": ["Automation", "ntfy", "Cron", "FastAPI", "Bash", "Monitoring"],
    "impact": "Early warnings for service failures; <1 min mean detection time across VMs/LXCs.",
    "links": {
      "repo": "",
      "demo": "",
      "loom": "https://www.loom.com/share/your-video-id"
    }
  },
  {
    "title": "iOS Shortcut Automation Suite (Privacy-First Capture + Self-Hosted AI Integrations)",
    "description": "A suite of Apple Shortcuts that standardizes quick capture (clipboard/share sheet/voice), enforces clean data handoffs, and produces consistent structured outputs for work and personal workflows. Core flows use Apple Shortcuts’ on-device model; advanced flows optionally call self-hosted LLM endpoints (Ollama/Open WebUI) over Tailscale.",
    "highlights": [
      "Brain Dump: clipboard-first (or prompt if empty) + on-device model to turn messy thoughts into priorities, next actions, questions, and a short plan in the user’s tone",
      "Reusable 'safe dictionary' pattern to prevent broken handoffs between shortcuts and preserve required fields/defaults",
      "Share-sheet entry points for quick capture from apps; consistent formatting for highlights/Reminders/logs",
      "Optional AI integrations: Shortcuts that POST to Ollama/Open WebUI endpoints via webhook/router over Tailscale (no third-party SaaS required)",
      "Built with edge cases in mind: empty inputs, missing fields, retries/timeouts for network calls, and deterministic templates for repeatable outputs"
    ],
    "tech": [
      "Apple Shortcuts",
      "iOS Automation",
      "Productivity",
      "Privacy",
      "Ollama",
      "Open WebUI",
      "Tailscale",
      "Workflow Design"
    ],
    "impact": "Reduced time spent on repetitive admin and note-processing by turning unstructured inputs into predictable, reusable formats; privacy-first defaults keep sensitive content on-device with opt-in, controlled self-hosted processing for richer outputs.",
    "links": {
      "repo": "",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Wiki.js MCP Server for Open WebUI",
    "description": "Custom MCP server (Python) to create/search Wiki.js pages directly from Open WebUI, enabling hands-on docs automation.",
    "highlights": [
      "mcpo wrapper; structured commands (create/find/update)",
      "Auth + namespace routing",
      "Unit tests for page ops; error surface to UI",
      "Docs: setup + sample flows"
    ],
    "tech": ["Python", "MCP", "Open WebUI", "Wiki.js", "APIs"],
    "impact": "One-click page creation from the chat UI; reduced context switching and stale docs.",
    "links": {
      "repo": "https://github.com/TcDrozd/wikijs-mcp-server",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Heart Log – AI-Powered Love Language Classifier",
    "description": "Flask-based web app with integrated API that classifies user-submitted relationship moments into love language categories using a local Ollama LLM.",
    "highlights": [
      "Two Flask endpoints: main UI + categorization API",
      "Prompt-engineered JSON output for consistent structure",
      "Handles malformed responses gracefully with fallback parsing",
      "Decoupled Ollama server over LAN for flexible deployment",
      "Dockerized for portability; environment-driven configuration"
    ],
    "tech": [
      "Python",
      "Flask",
      "APIs",
      "Ollama",
      "Prompt Engineering",
      "Docker"
    ],
    "impact": "Automates categorization of personal relationship entries, enabling quick reflection on patterns over time without manual tagging.",
    "links": {
      "repo": "https://github.com/TcDrozd/heart-log",
      "demo": "",
      "loom": ""
    }
  },
  {
    "title": "Capybara Party",
    "description": "A whimsical Flask web app serving daily capybara-themed art and zen-like quotes generated with local AI models. Built to be playful, self-sustaining, and low-maintenance while showcasing Python backend and automation skills.",
    "highlights": [
      "Flask backend serving daily refreshed static content (images + quotes)",
      "AI integration: Ollama models generate inspirational quotes, Stable Diffusion generates artwork",
      "Automated daily update pipeline with cron and file rotation",
      "Systemd service for process management and reliability",
      "Nginx reverse proxy for clean domain routing with SSL",
      "Lightweight, self-contained design — minimal upkeep once deployed"
    ],
    "tech": [
      "Python (Flask)",
      "Ollama",
      "Stable Diffusion",
      "Nginx",
      "Systemd",
      "Cron"
    ],
    "impact": "",
    "links": {
      "repo": "https://github.com/tcdrozd/capybara-party",
      "demo": "https://capybaraparty.com",
      "loom": ""
    }
  },
  {
    "title": "Sunflower Log",
    "description": "A photo-journal web app to track and share the growth of a sunflower over the summer. Combines a clean Flask interface with structured logging, EXIF photo metadata extraction, and production-grade deployment behind Nginx.",
    "highlights": [
      "Flask backend with file upload, EXIF metadata parsing, and thumbnail generation",
      "Responsive UI with gallery-style layout for browsing photo entries",
      "Confirmation modal on upload to prevent accidental duplicates",
      "Deployed behind Nginx reverse proxy with custom domain and SSL",
      "Gunicorn WSGI server managed via systemd for reliability",
      "Organized project structure with Docker-ready configuration for future portability",
      "CI/CD hooks for smooth updates via Git"
    ],
    "tech": [
      "Python (Flask)",
      "Gunicorn",
      "Nginx",
      "Systemd",
      "ExifRead",
      "SQLite/Postgres (configurable)"
    ],
    "impact": "",
    "links": {
      "repo": "https://github.com/tcdrozd/sunflower",
      "demo": "https://sunflower.capybaraparty.com",
      "loom": ""
    }
  }
]
